### `Data Merge`
Data merge is a process of combining information from different datasets into a single dataset. It involves bringing together data from multiple sources or tables based on a common identifier or key. This allows you to create a unified view of your data, making it easier to analyze and draw insights from. In simple terms, data merge helps you consolidate and organize data from various sources into one comprehensive dataset.

In [7]:
import pandas as pd
data1={
    'id':[1,2,3],
    'name':["ali","ahmed","zakir"],
    'age':[10,20,30]
}
df1 = pd.DataFrame(data1)
df1.head()

   id   name  age
0   1    ali   10
1   2  ahmed   20
2   3  zakir   30

In [8]:
data2 = {
    'id': [1, 2, 4],
    'salery': [1000, 2000, 3000],
    'occupation': ["engineer", "doctor", "police"]
}
df2=pd.DataFrame(data2)
df2.head()

   id  salery occupation
0   1    1000   engineer
1   2    2000     doctor
2   4    3000     police

In [9]:
pd.merge(df1,df2, on='id', how='inner')

   id   name  age  salery occupation
0   1    ali   10    1000   engineer
1   2  ahmed   20    2000     doctor